---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.GetColumnWidth(System.Int32)
source: html/7a700408-2556-6a55-aac8-0702c3916e70.htm
---
# Autodesk.Revit.DB.TableSectionData.GetColumnWidth Method

Returns a column's width in feet

## Syntax (C#)
```csharp
public double GetColumnWidth(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given column number nCol is invalid.